In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

数据对象创建

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('2019-11-01', periods=6)
dates

DatetimeIndex(['2019-11-01', '2019-11-02', '2019-11-03', '2019-11-04',
               '2019-11-05', '2019-11-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(data=np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2019-11-01  2.263923  0.732814 -0.632221 -0.208465
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706
2019-11-04  0.056393  0.458687 -1.248213 -1.568896
2019-11-05 -0.427761 -0.584297 -2.376625 -1.265407
2019-11-06 -0.584477  0.753955 -1.361160 -1.858410

In [6]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20191101'),
                   'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D':np.array([3]*4, dtype='int32'),
                   'E':pd.Categorical(['test','train','test','train']),
                   'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2019-11-01  1.0  3   test  foo
1  1.0 2019-11-01  1.0  3  train  foo
2  1.0 2019-11-01  1.0  3   test  foo
3  1.0 2019-11-01  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

数据查看

In [8]:
df.head()

                   A         B         C         D
2019-11-01  2.263923  0.732814 -0.632221 -0.208465
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706
2019-11-04  0.056393  0.458687 -1.248213 -1.568896
2019-11-05 -0.427761 -0.584297 -2.376625 -1.265407

In [9]:
 df.head(1)

                   A         B         C         D
2019-11-01  2.263923  0.732814 -0.632221 -0.208465

In [10]:
df.tail(2)

                   A         B         C         D
2019-11-05 -0.427761 -0.584297 -2.376625 -1.265407
2019-11-06 -0.584477  0.753955 -1.361160 -1.858410

In [11]:
df.index

DatetimeIndex(['2019-11-01', '2019-11-02', '2019-11-03', '2019-11-04',
               '2019-11-05', '2019-11-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.values

array([[ 2.26392323,  0.73281394, -0.63222134, -0.20846495],
       [-1.03013103, -0.48296033, -0.4561558 ,  1.09800957],
       [ 0.66753897, -2.06923027, -0.03903837, -0.44670567],
       [ 0.0563926 ,  0.45868706, -1.24821334, -1.56889553],
       [-0.42776125, -0.58429684, -2.37662523, -1.26540722],
       [-0.5844773 ,  0.75395497, -1.36116037, -1.85841045]])

In [14]:
df.values.shape

(6, 4)

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.157581 -0.198505 -1.018902 -0.708312
std    1.184138  1.089569  0.829394  1.091308
min   -1.030131 -2.069230 -2.376625 -1.858410
25%   -0.545298 -0.558963 -1.332924 -1.493023
50%   -0.185684 -0.012137 -0.940217 -0.856056
75%    0.514752  0.664282 -0.500172 -0.268025
max    2.263923  0.753955 -0.039038  1.098010

In [16]:
df.T

   2019-11-01  2019-11-02  2019-11-03  2019-11-04  2019-11-05  2019-11-06
A    2.263923   -1.030131    0.667539    0.056393   -0.427761   -0.584477
B    0.732814   -0.482960   -2.069230    0.458687   -0.584297    0.753955
C   -0.632221   -0.456156   -0.039038   -1.248213   -2.376625   -1.361160
D   -0.208465    1.098010   -0.446706   -1.568896   -1.265407   -1.858410

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-11-01 -0.208465 -0.632221  0.732814  2.263923
2019-11-02  1.098010 -0.456156 -0.482960 -1.030131
2019-11-03 -0.446706 -0.039038 -2.069230  0.667539
2019-11-04 -1.568896 -1.248213  0.458687  0.056393
2019-11-05 -1.265407 -2.376625 -0.584297 -0.427761
2019-11-06 -1.858410 -1.361160  0.753955 -0.584477

In [18]:
df.sort_values(by='B')

                   A         B         C         D
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706
2019-11-05 -0.427761 -0.584297 -2.376625 -1.265407
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010
2019-11-04  0.056393  0.458687 -1.248213 -1.568896
2019-11-01  2.263923  0.732814 -0.632221 -0.208465
2019-11-06 -0.584477  0.753955 -1.361160 -1.858410

数据选择

In [19]:
df['A']

2019-11-01    2.263923
2019-11-02   -1.030131
2019-11-03    0.667539
2019-11-04    0.056393
2019-11-05   -0.427761
2019-11-06   -0.584477
Freq: D, Name: A, dtype: float64

In [20]:
df[1:3]

                   A        B         C         D
2019-11-02 -1.030131 -0.48296 -0.456156  1.098010
2019-11-03  0.667539 -2.06923 -0.039038 -0.446706

In [21]:
df['2019-11-02':'2019-11-04']

                   A         B         C         D
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706
2019-11-04  0.056393  0.458687 -1.248213 -1.568896

In [22]:
df.loc[dates[0]] #降维为1

A    2.263923
B    0.732814
C   -0.632221
D   -0.208465
Name: 2019-11-01 00:00:00, dtype: float64

In [23]:
df.loc[:, ['A','B']]

                   A         B
2019-11-01  2.263923  0.732814
2019-11-02 -1.030131 -0.482960
2019-11-03  0.667539 -2.069230
2019-11-04  0.056393  0.458687
2019-11-05 -0.427761 -0.584297
2019-11-06 -0.584477  0.753955

In [24]:
df.loc[dates[0],'A'] #输出标量

2.2639232335632147

In [25]:
df.iloc[3] #使用索引

A    0.056393
B    0.458687
C   -1.248213
D   -1.568896
Name: 2019-11-04 00:00:00, dtype: float64

In [26]:
df.iloc[1:3,2:4]

                   C         D
2019-11-02 -0.456156  1.098010
2019-11-03 -0.039038 -0.446706

In [27]:
df.iloc[[1,2,3],[2,3]]

                   C         D
2019-11-02 -0.456156  1.098010
2019-11-03 -0.039038 -0.446706
2019-11-04 -1.248213 -1.568896

In [28]:
df[df.A > 0]

                   A         B         C         D
2019-11-01  2.263923  0.732814 -0.632221 -0.208465
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706
2019-11-04  0.056393  0.458687 -1.248213 -1.568896

In [29]:
df[df > 0]

                   A         B   C        D
2019-11-01  2.263923  0.732814 NaN      NaN
2019-11-02       NaN       NaN NaN  1.09801
2019-11-03  0.667539       NaN NaN      NaN
2019-11-04  0.056393  0.458687 NaN      NaN
2019-11-05       NaN       NaN NaN      NaN
2019-11-06       NaN  0.753955 NaN      NaN

In [30]:
df1 = df.copy()
df1['E'] = ['one','two','three','four','five','six']
df1

                   A         B         C         D      E
2019-11-01  2.263923  0.732814 -0.632221 -0.208465    one
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010    two
2019-11-03  0.667539 -2.069230 -0.039038 -0.446706  three
2019-11-04  0.056393  0.458687 -1.248213 -1.568896   four
2019-11-05 -0.427761 -0.584297 -2.376625 -1.265407   five
2019-11-06 -0.584477  0.753955 -1.361160 -1.858410    six

In [31]:
df1[df1['E'].isin(['two','four'])]

                   A         B         C         D     E
2019-11-02 -1.030131 -0.482960 -0.456156  1.098010   two
2019-11-04  0.056393  0.458687 -1.248213 -1.568896  four

In [32]:
s1 = pd.Series(data=[1,2,3,4,5],
              index=pd.date_range('2019-11-02', periods=5))
s1

2019-11-02    1
2019-11-03    2
2019-11-04    3
2019-11-05    4
2019-11-06    5
Freq: D, dtype: int64

In [33]:
df['F'] = s1
df.at[dates[0], 'A'] = 0 #返回标量
df.iat[0, 1] = 0
df.loc[:, 'D'] = np.array([5]*len(df))
df

                   A         B         C  D    F
2019-11-01  0.000000  0.000000 -0.632221  5  NaN
2019-11-02 -1.030131 -0.482960 -0.456156  5  1.0
2019-11-03  0.667539 -2.069230 -0.039038  5  2.0
2019-11-04  0.056393  0.458687 -1.248213  5  3.0
2019-11-05 -0.427761 -0.584297 -2.376625  5  4.0
2019-11-06 -0.584477  0.753955 -1.361160  5  5.0

In [34]:
df3 = df.copy()
df3[df3 > 0] = -df3
df3

                   A         B         C  D    F
2019-11-01  0.000000  0.000000 -0.632221 -5  NaN
2019-11-02 -1.030131 -0.482960 -0.456156 -5 -1.0
2019-11-03 -0.667539 -2.069230 -0.039038 -5 -2.0
2019-11-04 -0.056393 -0.458687 -1.248213 -5 -3.0
2019-11-05 -0.427761 -0.584297 -2.376625 -5 -4.0
2019-11-06 -0.584477 -0.753955 -1.361160 -5 -5.0

缺失数据处理

In [35]:
df4 = df.reindex(index=dates[0:4],
                columns=list(df.columns) + ['E'])
df4.loc[dates[0]:dates[1], 'E'] = 1
df4

                   A         B         C  D    F    E
2019-11-01  0.000000  0.000000 -0.632221  5  NaN  1.0
2019-11-02 -1.030131 -0.482960 -0.456156  5  1.0  1.0
2019-11-03  0.667539 -2.069230 -0.039038  5  2.0  NaN
2019-11-04  0.056393  0.458687 -1.248213  5  3.0  NaN

In [36]:
df4.dropna(how='any')

                   A        B         C  D    F    E
2019-11-02 -1.030131 -0.48296 -0.456156  5  1.0  1.0

In [37]:
df4.fillna(6)

                   A         B         C  D    F    E
2019-11-01  0.000000  0.000000 -0.632221  5  6.0  1.0
2019-11-02 -1.030131 -0.482960 -0.456156  5  1.0  1.0
2019-11-03  0.667539 -2.069230 -0.039038  5  2.0  6.0
2019-11-04  0.056393  0.458687 -1.248213  5  3.0  6.0

In [38]:
df4.isnull()

                A      B      C      D      F      E
2019-11-01  False  False  False  False   True  False
2019-11-02  False  False  False  False  False  False
2019-11-03  False  False  False  False  False   True
2019-11-04  False  False  False  False  False   True

In [39]:
pd.isnull(df4)

                A      B      C      D      F      E
2019-11-01  False  False  False  False   True  False
2019-11-02  False  False  False  False  False  False
2019-11-03  False  False  False  False  False   True
2019-11-04  False  False  False  False  False   True

统计操作

In [40]:
df.mean() #按列求平均值

A   -0.219740
B   -0.320641
C   -1.018902
D    5.000000
F    3.000000
dtype: float64

In [41]:
df.mean(axis=1) #按列求平均值

2019-11-01    1.091945
2019-11-02    0.806151
2019-11-03    1.111854
2019-11-04    1.453373
2019-11-05    1.122263
2019-11-06    1.761663
Freq: D, dtype: float64

In [42]:
s1 = pd.Series(data=[1,2,3,np.nan,4,5],
              index=dates)
s1

2019-11-01    1.0
2019-11-02    2.0
2019-11-03    3.0
2019-11-04    NaN
2019-11-05    4.0
2019-11-06    5.0
Freq: D, dtype: float64

In [43]:
s1.shift(2) #向下移动2行

2019-11-01    NaN
2019-11-02    NaN
2019-11-03    1.0
2019-11-04    2.0
2019-11-05    3.0
2019-11-06    NaN
Freq: D, dtype: float64

In [44]:
s1.shift(-2) #向上移动2行

2019-11-01    3.0
2019-11-02    NaN
2019-11-03    4.0
2019-11-04    5.0
2019-11-05    NaN
2019-11-06    NaN
Freq: D, dtype: float64

In [45]:
df.sub(s1, axis='index') #减操作，有NaN操作结果为NaN

                   A         B         C    D    F
2019-11-01 -1.000000 -1.000000 -1.632221  4.0  NaN
2019-11-02 -3.030131 -2.482960 -2.456156  3.0 -1.0
2019-11-03 -2.332461 -5.069230 -3.039038  2.0 -1.0
2019-11-04       NaN       NaN       NaN  NaN  NaN
2019-11-05 -4.427761 -4.584297 -6.376625  1.0  0.0
2019-11-06 -5.584477 -4.246045 -6.361160  0.0  0.0

In [46]:
df

                   A         B         C  D    F
2019-11-01  0.000000  0.000000 -0.632221  5  NaN
2019-11-02 -1.030131 -0.482960 -0.456156  5  1.0
2019-11-03  0.667539 -2.069230 -0.039038  5  2.0
2019-11-04  0.056393  0.458687 -1.248213  5  3.0
2019-11-05 -0.427761 -0.584297 -2.376625  5  4.0
2019-11-06 -0.584477  0.753955 -1.361160  5  5.0

In [47]:
df.apply(np.cumsum) #应用np或df函数

                   A         B         C   D     F
2019-11-01  0.000000  0.000000 -0.632221   5   NaN
2019-11-02 -1.030131 -0.482960 -1.088377  10   1.0
2019-11-03 -0.362592 -2.552191 -1.127416  15   3.0
2019-11-04 -0.306199 -2.093504 -2.375629  20   6.0
2019-11-05 -0.733961 -2.677800 -4.752254  25  10.0
2019-11-06 -1.318438 -1.923845 -6.113414  30  15.0

In [48]:
df.apply(lambda x: x.max() - x.min()) #应用lambda表达式

A    1.697670
B    2.823185
C    2.337587
D    0.000000
F    4.000000
dtype: float64

In [49]:
s1.value_counts() #统计值出现的次数，前为值，后为次数

5.0    1
4.0    1
3.0    1
2.0    1
1.0    1
dtype: int64

In [50]:
s2 = pd.Series(data=["a","b",2,'d'])
s2.str.upper() #字符串操作方法

0      A
1      B
2    NaN
3      D
dtype: object

数据合并

In [51]:
df5 = pd.DataFrame(data=np.random.randn(10,4))
df5

          0         1         2         3
0 -0.550537  0.735171  2.480007 -0.039346
1 -1.204075  0.017135 -0.560281  0.837813
2  0.437171  0.720687  0.846291 -0.341654
3 -1.022967  0.577202  1.073812 -1.240146
4 -1.826134 -0.859581 -0.595308  1.050616
5 -0.715317 -1.307997  0.456051 -0.710072
6 -0.349407 -1.188919  0.062825  1.124639
7 -0.128557 -0.326156  1.376088  1.531365
8  1.759025 -1.318747  0.109104  0.152715
9  0.608318 -0.533531 -0.219109  1.144439

In [52]:
pd.concat([df5[:3],df5[3:7],df5[7:]]) #拼接

          0         1         2         3
0 -0.550537  0.735171  2.480007 -0.039346
1 -1.204075  0.017135 -0.560281  0.837813
2  0.437171  0.720687  0.846291 -0.341654
3 -1.022967  0.577202  1.073812 -1.240146
4 -1.826134 -0.859581 -0.595308  1.050616
5 -0.715317 -1.307997  0.456051 -0.710072
6 -0.349407 -1.188919  0.062825  1.124639
7 -0.128557 -0.326156  1.376088  1.531365
8  1.759025 -1.318747  0.109104  0.152715
9  0.608318 -0.533531 -0.219109  1.144439

In [53]:
left = pd.DataFrame(data={'key':['foo','bar'],'val':[1,2]})
left

   key  val
0  foo    1
1  bar    2

In [54]:
right = pd.DataFrame(data={'key':['foo','bar'],'val':[4,5]})
right

   key  val
0  foo    4
1  bar    5

In [55]:
pd.merge(left, right, on='key') #同sql join

   key  val_x  val_y
0  foo      1      4
1  bar      2      5

In [56]:
df5.append(df5.iloc[5], ignore_index=True) #添加数据

           0         1         2         3
0  -0.550537  0.735171  2.480007 -0.039346
1  -1.204075  0.017135 -0.560281  0.837813
2   0.437171  0.720687  0.846291 -0.341654
3  -1.022967  0.577202  1.073812 -1.240146
4  -1.826134 -0.859581 -0.595308  1.050616
5  -0.715317 -1.307997  0.456051 -0.710072
6  -0.349407 -1.188919  0.062825  1.124639
7  -0.128557 -0.326156  1.376088  1.531365
8   1.759025 -1.318747  0.109104  0.152715
9   0.608318 -0.533531 -0.219109  1.144439
10 -0.715317 -1.307997  0.456051 -0.710072

数据分组

In [57]:
df6 = pd.DataFrame(data={'A':['foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
                        'B':['one', 'two', 'three', 'one', 'two', 'three'],
                        'C':[1,2,3,4,5,6],
                        'D':[2,3,4,5,6,7]})
df6

     A      B  C  D
0  foo    one  1  2
1  bar    two  2  3
2  foo  three  3  4
3  bar    one  4  5
4  foo    two  5  6
5  bar  three  6  7

In [58]:
df6.groupby('A').sum()

      C   D
A
bar  12  15
foo   9  12

In [59]:
df6.groupby(['A', 'B']).sum()

           C  D
A   B
bar one    4  5
    three  6  7
    two    2  3
foo one    1  2
    three  3  4
    two    5  6

数据变形

In [60]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'quz', 'quz'],
                   ['one', 'two','one', 'two','one', 'two','one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('quz', 'one'),
 ('quz', 'two')]

In [61]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second']) #生成多层索引
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'quz'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [62]:
df7 = pd.DataFrame(data=np.random.randn(8,2),
                  index=index,
                  columns=['A','B'])
df7

                     A         B
first second
bar   one    -0.346032  1.405150
      two    -0.092650 -0.994106
baz   one     0.725752  0.184423
      two     1.663763  0.450704
foo   one     0.656123  0.529831
      two    -1.264534 -1.265680
quz   one    -0.629181 -0.128828
      two     0.794620  0.709548

In [63]:
df7.stack() #列索引变行索引

first  second
bar    one     A   -0.346032
               B    1.405150
       two     A   -0.092650
               B   -0.994106
baz    one     A    0.725752
               B    0.184423
       two     A    1.663763
               B    0.450704
foo    one     A    0.656123
               B    0.529831
       two     A   -1.264534
               B   -1.265680
quz    one     A   -0.629181
               B   -0.128828
       two     A    0.794620
               B    0.709548
dtype: float64

In [64]:
df7.unstack() #行索引变列索引

               A                   B
second       one       two       one       two
first
bar    -0.346032 -0.092650  1.405150 -0.994106
baz     0.725752  1.663763  0.184423  0.450704
foo     0.656123 -1.264534  0.529831 -1.265680
quz    -0.629181  0.794620 -0.128828  0.709548

In [65]:
df6['E'] = ['a', 'b', 'c'] * 2
df6

     A      B  C  D  E
0  foo    one  1  2  a
1  bar    two  2  3  b
2  foo  three  3  4  c
3  bar    one  4  5  a
4  foo    two  5  6  b
5  bar  three  6  7  c

In [66]:
df6.pivot_table(values=['C', 'D'],
               index=['A', 'B'],
               columns=['E']) #数据透视表

             C              D
E            a    b    c    a    b    c
A   B
bar one    4.0  NaN  NaN  5.0  NaN  NaN
    three  NaN  NaN  6.0  NaN  NaN  7.0
    two    NaN  2.0  NaN  NaN  3.0  NaN
foo one    1.0  NaN  NaN  2.0  NaN  NaN
    three  NaN  NaN  3.0  NaN  NaN  4.0
    two    NaN  5.0  NaN  NaN  6.0  NaN

数据类别

In [67]:
df8 = pd.DataFrame(data={'id':[1,2,3,4,5,6],
                        'raw_grade':['a','b','b','d','e','d']})
df8

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         d
4   5         e
5   6         d

In [68]:
df8['grade'] = df8['raw_grade'].astype('category')
df8['grade']

0    a
1    b
2    b
3    d
4    e
5    d
Name: grade, dtype: category
Categories (4, object): [a, b, d, e]

In [69]:
df8['grade'].cat.categories = ['very good', 'good',  'bad', 'very bad',] #赋予不同的类别数据
df8['grade']

0    very good
1         good
2         good
3          bad
4     very bad
5          bad
Name: grade, dtype: category
Categories (4, object): [very good, good, bad, very bad]

In [70]:
df8['grade'] = df8['grade'].cat.set_categories(['very good', 'good', 'medium', 'bad', 'very bad'])
df8['grade']

0    very good
1         good
2         good
3          bad
4     very bad
5          bad
Name: grade, dtype: category
Categories (5, object): [very good, good, medium, bad, very bad]

In [71]:
df8.sort_values(by='grade') #按定义顺序排列

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         d        bad
5   6         d        bad
4   5         e   very bad

In [72]:
df8.groupby(by='grade').size() #类别梳理

grade
very good    1
good         2
medium       0
bad          2
very bad     1
dtype: int64

时间序列

In [73]:
rng = pd.date_range(start='1/1/2019',
                   periods=100,
                   freq='S') #以秒为单位创建100的时间段
rng

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 00:00:01',
               '2019-01-01 00:00:02', '2019-01-01 00:00:03',
               '2019-01-01 00:00:04', '2019-01-01 00:00:05',
               '2019-01-01 00:00:06', '2019-01-01 00:00:07',
               '2019-01-01 00:00:08', '2019-01-01 00:00:09',
               '2019-01-01 00:00:10', '2019-01-01 00:00:11',
               '2019-01-01 00:00:12', '2019-01-01 00:00:13',
               '2019-01-01 00:00:14', '2019-01-01 00:00:15',
               '2019-01-01 00:00:16', '2019-01-01 00:00:17',
               '2019-01-01 00:00:18', '2019-01-01 00:00:19',
               '2019-01-01 00:00:20', '2019-01-01 00:00:21',
               '2019-01-01 00:00:22', '2019-01-01 00:00:23',
               '2019-01-01 00:00:24', '2019-01-01 00:00:25',
               '2019-01-01 00:00:26', '2019-01-01 00:00:27',
               '2019-01-01 00:00:28', '2019-01-01 00:00:29',
               '2019-01-01 00:00:30', '2019-01-01 00:00:31',
               '2019-01-01 00:00:32', '2019-01-01 00:00:33',
               '2019-01-01 00:00:34', '2019-01-01 00:00:35',
               '2019-01-01 00:00:36', '2019-01-01 00:00:37',
               '2019-01-01 00:00:38', '2019-01-01 00:00:39',
               '2019-01-01 00:00:40', '2019-01-01 00:00:41',
               '2019-01-01 00:00:42', '2019-01-01 00:00:43',
               '2019-01-01 00:00:44', '2019-01-01 00:00:45',
               '2019-01-01 00:00:46', '2019-01-01 00:00:47',
               '2019-01-01 00:00:48', '2019-01-01 00:00:49',
               '2019-01-01 00:00:50', '2019-01-01 00:00:51',
               '2019-01-01 00:00:52', '2019-01-01 00:00:53',
               '2019-01-01 00:00:54', '2019-01-01 00:00:55',
               '2019-01-01 00:00:56', '2019-01-01 00:00:57',
               '2019-01-01 00:00:58', '2019-01-01 00:00:59',
               '2019-01-01 00:01:00', '2019-01-01 00:01:01',
               '2019-01-01 00:01:02', '2019-01-01 00:01:03',
               '2019-01-01 00:01:04', '2019-01-01 00:01:05',
               '2019-01-01 00:01:06', '2019-01-01 00:01:07',
               '2019-01-01 00:01:08', '2019-01-01 00:01:09',
               '2019-01-01 00:01:10', '2019-01-01 00:01:11',
               '2019-01-01 00:01:12', '2019-01-01 00:01:13',
               '2019-01-01 00:01:14', '2019-01-01 00:01:15',
               '2019-01-01 00:01:16', '2019-01-01 00:01:17',
               '2019-01-01 00:01:18', '2019-01-01 00:01:19',
               '2019-01-01 00:01:20', '2019-01-01 00:01:21',
               '2019-01-01 00:01:22', '2019-01-01 00:01:23',
               '2019-01-01 00:01:24', '2019-01-01 00:01:25',
               '2019-01-01 00:01:26', '2019-01-01 00:01:27',
               '2019-01-01 00:01:28', '2019-01-01 00:01:29',
               '2019-01-01 00:01:30', '2019-01-01 00:01:31',
               '2019-01-01 00:01:32', '2019-01-01 00:01:33',
               '2019-01-01 00:01:34', '2019-01-01 00:01:35',
               '2019-01-01 00:01:36', '2019-01-01 00:01:37',
               '2019-01-01 00:01:38', '2019-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [75]:
s3 = pd.Series(data=np.random.randint(0, 100, len(rng)),
              index=rng)
s3

2019-01-01 00:00:00    63
2019-01-01 00:00:01    93
2019-01-01 00:00:02    40
2019-01-01 00:00:03    90
2019-01-01 00:00:04    51
2019-01-01 00:00:05    32
2019-01-01 00:00:06    72
2019-01-01 00:00:07    21
2019-01-01 00:00:08    26
2019-01-01 00:00:09    61
2019-01-01 00:00:10    73
2019-01-01 00:00:11    14
2019-01-01 00:00:12    61
2019-01-01 00:00:13    84
2019-01-01 00:00:14    59
2019-01-01 00:00:15    68
2019-01-01 00:00:16    18
2019-01-01 00:00:17    55
2019-01-01 00:00:18    83
2019-01-01 00:00:19    68
2019-01-01 00:00:20    94
2019-01-01 00:00:21    95
2019-01-01 00:00:22    21
2019-01-01 00:00:23    50
2019-01-01 00:00:24    99
2019-01-01 00:00:25    79
2019-01-01 00:00:26     8
2019-01-01 00:00:27    67
2019-01-01 00:00:28    71
2019-01-01 00:00:29    76
                       ..
2019-01-01 00:01:10    77
2019-01-01 00:01:11    27
2019-01-01 00:01:12     7
2019-01-01 00:01:13    84
2019-01-01 00:01:14    39
2019-01-01 00:01:15    61
2019-01-01 00:01:16    42
2019-01-01 00:01:17    63
2019-01-01 00:01:18    90
2019-01-01 00:01:19    63
2019-01-01 00:01:20    68
2019-01-01 00:01:21    63
2019-01-01 00:01:22    58
2019-01-01 00:01:23     9
2019-01-01 00:01:24    20
2019-01-01 00:01:25     2
2019-01-01 00:01:26    15
2019-01-01 00:01:27     7
2019-01-01 00:01:28    32
2019-01-01 00:01:29    53
2019-01-01 00:01:30    11
2019-01-01 00:01:31    71
2019-01-01 00:01:32    32
2019-01-01 00:01:33    31
2019-01-01 00:01:34    17
2019-01-01 00:01:35     4
2019-01-01 00:01:36    93
2019-01-01 00:01:37    93
2019-01-01 00:01:38     9
2019-01-01 00:01:39    37
Freq: S, Length: 100, dtype: int64

In [76]:
s3.resample('1Min').sum() #以1分钟为单位采样

2019-01-01 00:00:00    3446
2019-01-01 00:01:00    1644
Freq: T, dtype: int64